@@ -0,0 +1,33 @@
IDENTIFICATION DIVISION.
PROGRAM-ID. MIPROGRAMA.
AUTHOR ALQUIMISTA DE CODIGO.
INSTALLATION. ALQUIMISTA DE CODIGO.
DATE-WRITTEN. 23/06/19.
DATE-COMPILED.
SECURITY. NO ES CONFIDENCIAL.
DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-NUM-A PICTURE 9(5).
   01 WS-NUM-B PICTURE 9(5).
   01 WS-VOLUMEN PICTURE 9(9).
   01 WS-AREA PICTURE 9(9).
*> MAIN DEL PROGRAMA 
PROCEDURE DIVISION.
   MAIN.
   MOVE 20 TO WS-NUM-A.
   MOVE 40 TO WS-NUM-B.
   DISPLAY '*** CALCULOS ***'.
   COMPUTE WS-VOLUMEN = 2 * (3.14159 ** 2) * WS-NUM-B * (WS-NUM-A ** 2)
   DISPLAY 'R ='WS-NUM-B', r = 'WS-NUM-A.
   DISPLAY 'VOLUMEN DE UN TOROIDE : 'WS-VOLUMEN.
   DISPLAY 'b = 'WS-NUM-B', h ='WS-NUM-A.
   MOVE 30 TO WS-NUM-A.
   MOVE 45 TO WS-NUM-B.
   COMPUTE WS-AREA = WS-NUM-B * WS-NUM-A.
   DISPLAY 'BASE ='WS-NUM-B', ALTURA = 'WS-NUM-A.
   DISPLAY 'AREA DE UN PARALELOGRAMO ='WS-AREA.
  
STOP RUN.
